Revit 2027 API
BuiltInFailures.DesignOptionFailures.ConfusingSweepByElementsInDesignOption Property
 A sweep in the main model cannot be hosted by an element in a Design Option [--if you continue it will not be added to the design option set].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ConfusingSweepByElementsInDesignOption { get; }
Public Shared ReadOnly Property ConfusingSweepByElementsInDesignOption As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ConfusingSweepByElementsInDesignOption {
	FailureDefinitionId^ get ();
}
static member ConfusingSweepByElementsInDesignOption : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DesignOptionFailures Class
Autodesk.Revit.DB Namespace